{
  "backend/main.mo": "Motoko actor defining question types and correct answer mappings for four quiz categories (flags, sports, intelligence, science) using Map data structures indexed by question number.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: displaying correct answers on game over, increasing timer from 7 to 12 seconds, and updating welcome screen text to reflect the new timer duration.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, hooks, and configuration for the quiz game application with Persian RTL layout and 12-second timer.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, establishing the design system foundation for the quiz interface.",
  "frontend/index.html": "HTML entry point for the Hodhod Quiz Competition App with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component rendering the QuizGame page and Toaster notification component.",
  "frontend/src/components/GameOverScreen.tsx": "RTL game over screen displaying loss reason (timeout/wrong answer), question number, and the correct answer in a highlighted box with restart button.",
  "frontend/src/components/QuestionDisplay.tsx": "Question display component with numbered answer buttons showing green/red visual feedback for correct/incorrect selections and disabled state during feedback period.",
  "frontend/src/components/QuizTimer.tsx": "Visual countdown timer with progress bar and color-coded urgency states (urgent ≤3s, warning ≤6s) for the 12-second question duration.",
  "frontend/src/components/StartScreen.tsx": "RTL welcome screen introducing the quiz with Persian category descriptions, 12-second time warning, and start button.",
  "frontend/src/components/VictoryScreen.tsx": "RTL victory celebration screen with trophy animation and restart button shown when user successfully completes all 4 questions.",
  "frontend/src/data/questions.ts": "Exports arrays of quiz questions for four categories (flags, sports, intelligence, science) with Persian text, multiple-choice options, correct answer indices, and optional image URLs.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor using Internet Identity authentication, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching quiz questions from four categories, currently returning local data since backend methods are not yet implemented.",
  "frontend/src/hooks/useQuizGame.ts": "Main game logic hook managing quiz state, question progression through four categories, answer validation, sound effects, and game over/victory conditions with random question selection.",
  "frontend/src/hooks/useQuizTimer.ts": "Custom hook implementing a countdown timer that decrements every second and triggers a callback when time expires, with reset functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm orange/yellow color palette for light and dark themes, styled for the Hodhod market brand.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/QuizGame.tsx": "Main quiz game page component that orchestrates game flow between start, playing, game over, and victory screens, with background music and timer management.",
  "frontend/src/types/quiz.ts": "TypeScript type definitions for quiz questions, game states (idle/playing/gameOver/victory), and game over reasons (wrongAnswer/timeout).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, border radius, shadows, fonts, and animation keyframes for accordion and other UI components.",
  "project_state.json": "Project state tracking document for a Persian-language quiz competition app for Hodhod store with 4 category-based questions, 12-second timers, instant game-over on wrong answers, background music, and visual/audio feedback features."
}