{
  "backend/main.mo": "Motoko actor defining correct answer mappings for four quiz categories (flags, sports, intelligence, science) using Map data structures indexed by question number.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: expanded question pool, visual answer feedback, background music replacement, correct answer sound effects, and incorrect answer sound effects.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, hooks, pages, and data structures for the quiz game application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, featuring warm orange/yellow palette inspired by Middle Eastern aesthetics.",
  "frontend/index.html": "HTML entry point for the Hodhod Quiz Competition App with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component rendering the QuizGame page and Toaster notification component.",
  "frontend/src/components/GameOverScreen.tsx": "RTL game over screen component displaying loss message in Persian with reason (timeout/wrong answer), question number, and restart button.",
  "frontend/src/components/QuestionDisplay.tsx": "Question display component with dynamic button styling showing green feedback for correct answers, red for incorrect, disabled state during feedback, and numbered option buttons.",
  "frontend/src/components/QuizTimer.tsx": "Visual countdown timer component with progress bar, color-coded urgency states (urgent/warning/normal), and clock icon display.",
  "frontend/src/components/StartScreen.tsx": "RTL welcome screen introducing the quiz game with Persian text, four category descriptions with icons, 7-second time warning, and start button.",
  "frontend/src/components/VictoryScreen.tsx": "RTL victory celebration screen with trophy animation, sparkles, congratulatory message in Persian, and restart button shown after answering all 4 questions correctly.",
  "frontend/src/data/questions.ts": "Exports arrays of quiz questions for four categories (flags, sports, intelligence, science) with Persian text, multiple choice options, correct answer indices, and optional image URLs.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor using Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching quiz questions from four categories, currently returning local data since backend methods are not yet implemented.",
  "frontend/src/hooks/useQuizGame.ts": "Main game logic hook managing quiz state, question progression across categories, answer validation, sound effects, and game over/victory conditions with random question selection.",
  "frontend/src/hooks/useQuizTimer.ts": "Timer hook that counts down from a specified duration and triggers a callback on expiration, with reset functionality and active state control.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm orange/yellow color palette for light and dark themes, plus utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM.",
  "frontend/src/pages/QuizGame.tsx": "Main quiz game page component that orchestrates game screens (start, question, game over, victory), manages background music, and displays timer and question components.",
  "frontend/src/types/quiz.ts": "TypeScript type definitions for quiz data structures including Question, GameState, and GameOverReason interfaces.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom border radius, shadows, fonts, and animations, and includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a Persian-language quiz competition app for Hodhod store with 4 sequential multiple-choice questions across different categories, 7-second timers, instant game-over on wrong answers, and audio/visual feedback features."
}