{
  "backend/main.mo": "Motoko actor defining Question type and hardcoded correct answer mappings for four quiz categories (flags, sports, intelligence, science) with 3 questions each.",
  "feature_evidence.json": "Feature evidence report documenting the audit of country flag questions in frontend/src/data/questions.ts to verify correctAnswerIndex accuracy.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, hooks, pages, and data structures for the quiz game application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette for light and dark modes using CSS variables for theming.",
  "frontend/index.html": "HTML entry point for the Hodhod Quiz Competition App that mounts React at #root and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering QuizGame page and Toaster notification component.",
  "frontend/src/components/GameOverScreen.tsx": "RTL game over screen displaying loss reason (timeout/wrong answer), question number, correct answer in styled box, and restart button.",
  "frontend/src/components/QuestionDisplay.tsx": "Question display component with numbered option buttons showing green/red feedback for correct/incorrect answers and optional flag image.",
  "frontend/src/components/QuizTimer.tsx": "Visual countdown timer with progress bar and color-coded urgency states (urgent ≤3s, warning ≤6s) using the useQuizTimer hook.",
  "frontend/src/components/StartScreen.tsx": "RTL welcome screen with Persian category descriptions (flags, sports, intelligence, science), 12-second time warning, and start button.",
  "frontend/src/components/VictoryScreen.tsx": "RTL victory celebration screen with trophy animation and restart button shown after answering all 4 questions correctly.",
  "frontend/src/data/questions.ts": "Defines quiz question data arrays (flagQuestions, sportsQuestions, intelligenceQuestions, scienceQuestions) with Persian text, each containing question text, four options, correct answer index (0-3), and optional image URLs.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor using React Query, switching between authenticated and anonymous actors based on Internet Identity state, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence via AuthClient, and delegation validation with configurable idle options.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks (useGetFlagQuestions, useGetSportsQuestions, useGetIntelligenceQuestions, useGetScienceQuestions) that currently return local question data arrays, with placeholders for future backend integration.",
  "frontend/src/hooks/useQuizGame.ts": "Main game logic hook managing quiz state (current question, game state, answers, shuffled question indices), handling answer validation, timer expiration, game progression through four categories, and playing correct/incorrect sound effects.",
  "frontend/src/hooks/useQuizTimer.ts": "React hook that manages a countdown timer with configurable duration, triggering a callback on expiration and providing reset functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm orange/yellow color palette for light and dark modes, themed for the Hodhod market brand.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped in QueryClientProvider for React Query and InternetIdentityProvider for authentication.",
  "frontend/src/pages/QuizGame.tsx": "Main quiz game page component that orchestrates game flow (start screen, question display, game over, victory), manages background music playback, and renders the quiz UI with timer and question components.",
  "frontend/src/types/quiz.ts": "TypeScript type definitions for quiz domain: Question interface with text/options/correctAnswerIndex, GameState union type, and GameOverReason interface for tracking game end conditions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom border radii, shadows, fonts, and animations, and includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a Persian-language quiz competition app for Hodhod store with 4 sequential multiple-choice questions across different categories, 12-second timers, instant game-over on wrong answers, audio/visual feedback, and a known issue that all country flag question answers are incorrect."
}