{
  "backend/main.mo": "Motoko actor defining Question type and four Map collections (flagQuestions, sportsQuestions, intelligenceQuestions, scienceQuestions) that map question indices to correct answer indices.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON summary of frontend files describing a Persian RTL quiz game with 12-second timer, 4-question progression, answer feedback, background music, and category-based questions.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining design tokens for background, foreground, primary, destructive, and other UI colors.",
  "frontend/index.html": "HTML entry point for the Hodhod Quiz Competition App with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component rendering QuizGame page and Toaster for notifications.",
  "frontend/src/components/GameOverScreen.tsx": "RTL game over screen displaying loss reason (timeout/wrong answer), question number, optional correct answer in highlighted box, and restart button.",
  "frontend/src/components/QuestionDisplay.tsx": "Question display component with numbered option buttons showing green/red feedback for correct/incorrect answers and disabled state during feedback period.",
  "frontend/src/components/QuizTimer.tsx": "Countdown timer component with progress bar and color-coded urgency states (urgent ≤3s, warning ≤6s) using Clock icon.",
  "frontend/src/components/StartScreen.tsx": "RTL welcome screen with Persian category descriptions (flags, sports, intelligence, science), 12-second time warning, and start button.",
  "frontend/src/components/VictoryScreen.tsx": "RTL victory celebration screen with trophy animation, emoji celebration, and restart button shown after answering all 4 questions correctly.",
  "frontend/src/data/questions.ts": "Question data arrays for four categories (flags with image URLs, sports, intelligence, science) containing 15-18 Persian questions each with options and correct answer indices.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor for backend communication, invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient, managing identity state and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching quiz questions by category (flags, sports, intelligence, science), currently returning local data instead of backend calls.",
  "frontend/src/hooks/useQuizGame.ts": "Main game logic hook managing quiz state, question progression through categories, answer validation, sound effects, and game over/victory conditions with random question selection.",
  "frontend/src/hooks/useQuizTimer.ts": "Custom hook implementing a countdown timer that decrements every second and triggers a callback when time expires, with reset functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm orange/yellow color palette for light and dark modes themed for a Hodhod market quiz application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/QuizGame.tsx": "Main quiz game page component that orchestrates game screens (start, question display, game over, victory), manages background music, and displays timer and question UI.",
  "frontend/src/types/quiz.ts": "TypeScript type definitions for quiz questions, game states (idle/playing/gameOver/victory), and game over reasons.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH color space, border radius variables, animations, and typography plugins.",
  "project_state.json": "Project state file tracking a Persian-language quiz competition app for Hodhod store with 4 categorized multiple-choice questions, 12-second timers, instant game-over on wrong answers, and audio/visual feedback. Contains architectural notes, known issues (incorrect question-answer mappings), and feature tracking with requirement IDs."
}